# Demography

This first chart shows Spanish population by nationality for the 2005-2025 period. Describing total population and non spanish nationals figures. We will compute the percentage of Spanish ntaionals and foreign nationals from Spain total population by year.

## 1.Load required libraries

In [27]:
import pandas as pd
import os

In [28]:
# Specific libraries fro Seaborn charts
import seaborn as sns
import matplotlib.pyplot as plt
sns.set_theme(style="whitegrid")

- Get my current WD on this machine

In [29]:
my_wd = os.getcwd()
print("My working directory is:",my_wd)

My working directory is: C:\Users\pituf\OneDrive\Documentos\Pablo\DELL_PYTHON_projects\ML-using-Python

I need to change working directory to ML-using-Python to access data sub-folder

In [30]:
new_wd = os.path.join('C:/', 'Users','pituf','OneDrive','Documentos','Pablo', 'DELL_PYTHON_projects','ML-using-Python')
os.chdir(new_wd)

In [31]:
new_wd_defined = os.getcwd()
print("My working directory is:",new_wd_defined)

My working directory is: C:\Users\pituf\OneDrive\Documentos\Pablo\DELL_PYTHON_projects\ML-using-Python

## 2. Check data folder contents

We need first to list files in our \data folder to locate the Excel file we want to import for this chart, and also to obtain the specific tab name we will import data from.

In [6]:
# List folder contents using os.listdir() method in a Windows machine
data_folder = os.path.join('C:/', 'Users','pituf','OneDrive','Documentos','Pablo', 'DELL_PYTHON_projects','ML-using-Python',
                           'data')
data_folder_contents = os.listdir(data_folder)
print('data folder contents:',data_folder_contents)

data folder contents: ['01 INE resident population by nationality Spain and CV 2002 2024.xlsx', '02 INE Spain CV population stocks and flows 2002 2025.xlsx', '03_INE_Spain_natural_growh_births_deaths.xlsx', 'AE_Attendances_2010_2024.csv', 'AE_Time_Series_Data_website.txt', 'all_wine_reset.csv', 'INE Resident population country of birth Spain.xlsx', 'INE total and foreign population figures Spain.xlsx', 'Monthly-AE-Time-Series-January-2024.xls', 'monthly-milk-production-pounds.csv', 'OCDE_countries_population_figures_1970_2022.csv', 'ONS_Figure_01_Long_term_emigration_immigration_net_migration.xlsx', 'ONS_Figure_2__Population_increase_in_mid-2023_was_driven_mostly_by_net_international_migration.xls', 'ONS_long_term_immigration_end2024.xlsx', 'winequality-red.csv', 'winequality-white.csv', 'winequality.names', 'wine_quality.zip']

We have Listed data folder content using os.listdir() method, defining path to Excel filre using os.path.join() method

### 2.1 Build path to the Excel file in data folder to be imported

I build now the path to Excel file "INE total and foreign population figures Spain.xlsx" I want to import into python. As it is in a higher level as the working directory default path, I will use os.changedir() function to point to the \data folder instead of to the Seaborn_gallery, so I can load it into Python

In [32]:
ine_population_nationality = os.path.join('data','INE total and foreign population figures Spain.xlsx')
print('INE_population_nationality:',ine_population_nationality)

INE_population_nationality: data\INE total and foreign population figures Spain.xlsx

## 3. Load data into Python

First we want to display tab names from imported Excel file

In [33]:
# Ine population by nationality
ine_population_nationality = os.path.join('data','INE total and foreign population figures Spain.xlsx')
print('INE_population_nationality:',ine_population_nationality)

INE_population_nationality: data\INE total and foreign population figures Spain.xlsx

Then we use .sheet_names() function to display Excel tab names

In [34]:
my_excel_file = pd.ExcelFile(ine_population_nationality)

In [35]:
my_excel_file.sheet_names

['INE_Foreign_population',
 'INE_Total_population',
 'INE_Total_foreign_population']

This code below, using ead_excel() function loads file "INE total and foreign population figures Spain.xlsx" into Python. 
- By detault data is imported from first Excel tab and first row. Instead, we want to import data from third tab "INE_Total_foreign_population".
- Also, we want to import data starting from 2 row onwards.

In [36]:
ine_population_nationality = os.path.join('data',
                                          'INE total and foreign population figures Spain.xlsx')
print('INE_population_nationality:',ine_population_nationality)

INE_population_nationality: data\INE total and foreign population figures Spain.xlsx

In [37]:
INEdata = pd.read_excel(ine_population_nationality,
                        sheet_name='INE_Total_foreign_population',
                        skiprows=2)
INEdata.head()

,Todas las edades,Total,Foreign population,% Foreign Nationals/Total population,Total YoY(N),Total YoY)(%),Foreign Nationals YoY(N),Foreign Total YoY)(%)
0,1 de enero de 2025,49077984,6852348.0,0.139622,NaN,NaN,NaN,NaN
1,1 de enero de 2024,48619695,6502282.0,0.133738,458289.0,0.009426,350066.0,0.053837
2,1 de enero de 2023,48085361,6089620.0,0.126642,534334.0,0.011112,412662.0,0.067765
3,1 de enero de 2022,47486727,5509046.0,0.116012,598634.0,0.012606,580574.0,0.105386
4,1 de enero de 2021,47400798,5402702.0,0.113979,85929.0,0.001813,106344.0,0.019683

- Subset previously imported data to keep just 20 first rows to skip footnotes.

In [38]:
INE_data_clean = INEdata.head(20)
INE_data_clean.head()

,Todas las edades,Total,Foreign population,% Foreign Nationals/Total population,Total YoY(N),Total YoY)(%),Foreign Nationals YoY(N),Foreign Total YoY)(%)
0,1 de enero de 2025,49077984,6852348.0,0.139622,NaN,NaN,NaN,NaN
1,1 de enero de 2024,48619695,6502282.0,0.133738,458289.0,0.009426,350066.0,0.053837
2,1 de enero de 2023,48085361,6089620.0,0.126642,534334.0,0.011112,412662.0,0.067765
3,1 de enero de 2022,47486727,5509046.0,0.116012,598634.0,0.012606,580574.0,0.105386
4,1 de enero de 2021,47400798,5402702.0,0.113979,85929.0,0.001813,106344.0,0.019683

In [39]:
INE_data_clean.columns

Index(['Todas las edades', 'Total', 'Foreign population',
       '% Foreign Nationals/Total population', 'Total YoY(N)', 'Total YoY)(%)',
       'Foreign Nationals YoY(N)', 'Foreign Total YoY)(%)'],
      dtype='object')

## 4. Rename and subset columns

Rename columns prior to creating stacked bar chart

In [40]:
INE_data_clean.columns = ['Date','Total_population','Foreign_population','Percent_foreign_population',
                          'Total_population YoY(N)','Total_population YoY(%)','Foreign population YoY(N)',
                          'Foreign population YoY(%)']

Subset columns from initially imported Excel file

In [41]:
INE_total_foreign_population = INE_data_clean[['Date','Total_population','Foreign_population']]

In [42]:
INE_total_foreign_population.head()

                 Date Total_population  Foreign_population
0  1 de enero de 2025         49077984           6852348.0
1  1 de enero de 2024         48619695           6502282.0
2  1 de enero de 2023         48085361           6089620.0
3  1 de enero de 2022         47486727           5509046.0
4  1 de enero de 2021         47400798           5402702.0

## 5. Create new calculated fields

From previously subsetted dataframe, we will recreate original calculations

### 5.1 New column for Year variable

We ned to extract year from Date fariable in INE_total_foreign_population dataframe. We use str.strip() function applied on "Date" column to create new **Year** variable.

In [43]:
INE_total_foreign_population['Year'] = INE_total_foreign_population['Date'].str.strip().str[13:]
INE_total_foreign_population

C:\Users\pituf\AppData\Local\Temp\ipykernel_16548\2507062884.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  INE_total_foreign_population['Year'] = INE_total_foreign_population['Date'].str.strip().str[13:]

                  Date Total_population  Foreign_population   Year
0   1 de enero de 2025         49077984           6852348.0   2025
1   1 de enero de 2024         48619695           6502282.0   2024
2   1 de enero de 2023         48085361           6089620.0   2023
3   1 de enero de 2022         47486727           5509046.0   2022
4   1 de enero de 2021         47400798           5402702.0   2021
5   1 de enero de 2020         47318050           5241278.0   2020
6   1 de enero de 2019         46918951           4850762.0   2019
7   1 de enero de 2018         46645070           4577322.0   2018
8   1 de enero de 2017         46497393           4417653.0   2017
9   1 de enero de 2016         46418884           4419334.0   2016
10  1 de enero de 2015         46425722           4453985.0   2015
11  1 de enero de 2014         46495744           4676352.0   2014
12  1 de enero de 2013         46712650           5064584.0   2013
13  1 de enero de 2012         46818216           5236030.0   2012
14  1 de enero de 2011         46667175           5312440.0   2011
15  1 de enero de 2010         46486621           5402579.0   2010
16  1 de enero de 2009         46239271           5386659.0   2009
17  1 de enero de 2008         45668938           5086295.0   2008
18  1 de enero de 2007         44784659           4449434.0   2007
19  1 de enero de 2006         44009969           3930916.0   2006

### 5.1 New column for Spanish nationals from total population figures

We substract Foreign from Total population figures to obtain Spanish natianals population

In [44]:
INE_population_nationality = INE_total_foreign_population.copy()
INE_population_nationality.head()

                 Date Total_population  Foreign_population   Year
0  1 de enero de 2025         49077984           6852348.0   2025
1  1 de enero de 2024         48619695           6502282.0   2024
2  1 de enero de 2023         48085361           6089620.0   2023
3  1 de enero de 2022         47486727           5509046.0   2022
4  1 de enero de 2021         47400798           5402702.0   2021

In [45]:
INE_population_nationality['Spanish_nationals'] = INE_population_nationality['Total_population']- INE_population_nationality['Foreign_population']
INE_population_nationality.head()

,Date,Total_population,Foreign_population,Year,Spanish_nationals
0,1 de enero de 2025,49077984,6852348.0,2025,42225636.0
1,1 de enero de 2024,48619695,6502282.0,2024,42117413.0
2,1 de enero de 2023,48085361,6089620.0,2023,41995741.0
3,1 de enero de 2022,47486727,5509046.0,2022,41977681.0
4,1 de enero de 2021,47400798,5402702.0,2021,41998096.0

In [46]:
INE_spain_population = INE_population_nationality.copy()
INE_spain_population.head()

,Date,Total_population,Foreign_population,Year,Spanish_nationals
0,1 de enero de 2025,49077984,6852348.0,2025,42225636.0
1,1 de enero de 2024,48619695,6502282.0,2024,42117413.0
2,1 de enero de 2023,48085361,6089620.0,2023,41995741.0
3,1 de enero de 2022,47486727,5509046.0,2022,41977681.0
4,1 de enero de 2021,47400798,5402702.0,2021,41998096.0

In [47]:
# Now we only have to re-order newly created columns
INE_spain_population = INE_spain_population[['Year','Total_population','Spanish_nationals','Foreign_population']]
INE_spain_population.head(10)

    Year Total_population Spanish_nationals  Foreign_population
0   2025         49077984        42225636.0           6852348.0
1   2024         48619695        42117413.0           6502282.0
2   2023         48085361        41995741.0           6089620.0
3   2022         47486727        41977681.0           5509046.0
4   2021         47400798        41998096.0           5402702.0
5   2020         47318050        42076772.0           5241278.0
6   2019         46918951        42068189.0           4850762.0
7   2018         46645070        42067748.0           4577322.0
8   2017         46497393        42079740.0           4417653.0
9   2016         46418884        41999550.0           4419334.0

## 6. Reshape data for stacked percent barplot from wide to long

Now that we have re-created both Year and Spanish nationals calculation and also we have Foreign_population column to compute perecnt barplot by nationality by year, we reshape our dataframe in preparation for bar plot.

In [48]:
Population_reshape = INE_spain_population.copy()
Population_reshape.head()

    Year Total_population Spanish_nationals  Foreign_population
0   2025         49077984        42225636.0           6852348.0
1   2024         48619695        42117413.0           6502282.0
2   2023         48085361        41995741.0           6089620.0
3   2022         47486727        41977681.0           5509046.0
4   2021         47400798        41998096.0           5402702.0

In [49]:
Population_reshape_sorted = Population_reshape.sort_values(by = 'Year', ascending = True)
Population_reshape_sorted.head()

     Year Total_population Spanish_nationals  Foreign_population
19   2006         44009969        40079053.0           3930916.0
18   2007         44784659        40335225.0           4449434.0
17   2008         45668938        40582643.0           5086295.0
16   2009         46239271        40852612.0           5386659.0
15   2010         46486621        41084042.0           5402579.0

In [50]:
Population_reshape_sorted.reset_index()

    index   Year Total_population Spanish_nationals  Foreign_population
0      19   2006         44009969        40079053.0           3930916.0
1      18   2007         44784659        40335225.0           4449434.0
2      17   2008         45668938        40582643.0           5086295.0
3      16   2009         46239271        40852612.0           5386659.0
4      15   2010         46486621        41084042.0           5402579.0
5      14   2011         46667175        41354735.0           5312440.0
6      13   2012         46818216        41582186.0           5236030.0
7      12   2013         46712650        41648066.0           5064584.0
8      11   2014         46495744        41819392.0           4676352.0
9      10   2015         46425722        41971737.0           4453985.0
10      9   2016         46418884        41999550.0           4419334.0
11      8   2017         46497393        42079740.0           4417653.0
12      7   2018         46645070        42067748.0           4577322.0
13      6   2019         46918951        42068189.0           4850762.0
14      5   2020         47318050        42076772.0           5241278.0
15      4   2021         47400798        41998096.0           5402702.0
16      3   2022         47486727        41977681.0           5509046.0
17      2   2023         48085361        41995741.0           6089620.0
18      1   2024         48619695        42117413.0           6502282.0
19      0   2025         49077984        42225636.0           6852348.0

In [51]:
df_to_reshape = Population_reshape_sorted[['Year','Total_population','Spanish_nationals','Foreign_population']]
df_to_reshape.head()

     Year Total_population Spanish_nationals  Foreign_population
19   2006         44009969        40079053.0           3930916.0
18   2007         44784659        40335225.0           4449434.0
17   2008         45668938        40582643.0           5086295.0
16   2009         46239271        40852612.0           5386659.0
15   2010         46486621        41084042.0           5402579.0

### 6.1 Subset columns prior to reshaping data

In [52]:
df_to_reshape_subset = df_to_reshape[['Year','Spanish_nationals','Foreign_population']]
df_to_reshape_subset.head()

     Year Spanish_nationals  Foreign_population
19   2006        40079053.0           3930916.0
18   2007        40335225.0           4449434.0
17   2008        40582643.0           5086295.0
16   2009        40852612.0           5386659.0
15   2010        41084042.0           5402579.0

### 6.2 Reshape data to have nationality on some column

We use pd.melt() function to display both Spanish_nationals and Foreign_population on the same column

In [53]:
population_long = pd.melt(df_to_reshape_subset,
                          id_vars = 'Year',
                          value_vars = ['Spanish_nationals','Foreign_population'])

In [54]:
population_long.head()

    Year           variable       value
0   2006  Spanish_nationals  40079053.0
1   2007  Spanish_nationals  40335225.0
2   2008  Spanish_nationals  40582643.0
3   2009  Spanish_nationals  40852612.0
4   2010  Spanish_nationals  41084042.0

In [55]:
population_long.tail()

     Year            variable      value
35   2021  Foreign_population  5402702.0
36   2022  Foreign_population  5509046.0
37   2023  Foreign_population  6089620.0
38   2024  Foreign_population  6502282.0
39   2025  Foreign_population  6852348.0

- Rename columns from re-shaped dataframe

In [56]:
population_long.columns = ['Year','Nationality','Value']

## 7. Bulding stacked barplot using seaborn

Now we have the dataframe in the right shape to build a stacked bar plot by nationality by year.

First we need to load required libraries to create Seaborn charts

In [59]:
import seaborn as sns
import matplotlib.pyplot as plt

Check nationailty unique values and set theme and figure size

In [60]:
sns.set_theme(style = 'darkgrid')
plt.figure(figsize=(14,24))

We need to create several calculations first to be able to plot our stacked bar chart

### 7.1 Calculation 01. Sum of all values

Compute total values to be used in the stacked bar chart.

In [61]:
total = population_long.groupby("Year")['Value'].sum().reset_index()
total.head()

    Year       Value
0   2006  44009969.0
1   2007  44784659.0
2   2008  45668938.0
3   2009  46239271.0
4   2010  46486621.0

- I need to import Scalar formatter to remove scientific notation from Y axis

In [ ]:
from matplotlib.ticker import ScalarFormatter